susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F052.h
/*
  * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
*/

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN_RX_PA11_ PA11,GPIO_AF4
#define CAN_RX_PB8_ PB8,GPIO_AF4
#define CAN_RX_PD0_ PD0,GPIO_AF0
#define _CAN_RX_PA11_ 1
#define _CAN_RX_PB8_ 1
#define _CAN_RX_PD0_ 1

#define CAN_TX_PA12_ PA12,GPIO_AF4
#define CAN_TX_PB9_ PB9,GPIO_AF4
#define CAN_TX_PD1_ PD1,GPIO_AF0
#define _CAN_TX_PA12_ 1
#define _CAN_TX_PB9_ 1
#define _CAN_TX_PD1_ 1

#define CEC_PA5_ PA5,GPIO_AF1
#define CEC_PB10_ PB10,GPIO_AF0
#define CEC_PB8_ PB8,GPIO_AF0
#define CEC_PC13_ PC13,GPIO_AF7
#define _CEC_PA5_ 1
#define _CEC_PB10_ 1
#define _CEC_PB8_ 1
#define _CEC_PC13_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA11_ PA11,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF7
#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1

#define CRS_SYNC_PA8_ PA8,GPIO_AF4
#define CRS_SYNC_PD15_ PD15,GPIO_AF0
#define CRS_SYNC_PF0_ PF0,GPIO_AF0
#define _CRS_SYNC_PA8_ 1
#define _CRS_SYNC_PD15_ 1
#define _CRS_SYNC_PF0_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF0
#define EVENTOUT_PA11_ PA11,GPIO_AF0
#define EVENTOUT_PA12_ PA12,GPIO_AF0
#define EVENTOUT_PA15_ PA15,GPIO_AF3
#define EVENTOUT_PA6_ PA6,GPIO_AF6
#define EVENTOUT_PA7_ PA7,GPIO_AF6
#define EVENTOUT_PA8_ PA8,GPIO_AF3
#define EVENTOUT_PB0_ PB0,GPIO_AF0
#define EVENTOUT_PB11_ PB11,GPIO_AF0
#define EVENTOUT_PB12_ PB12,GPIO_AF1
#define EVENTOUT_PB3_ PB3,GPIO_AF1
#define EVENTOUT_PB4_ PB4,GPIO_AF2
#define EVENTOUT_PB9_ PB9,GPIO_AF3
#define EVENTOUT_PC0_ PC0,GPIO_AF0
#define EVENTOUT_PC1_ PC1,GPIO_AF0
#define EVENTOUT_PC2_ PC2,GPIO_AF0
#define EVENTOUT_PC3_ PC3,GPIO_AF0
#define EVENTOUT_PC4_ PC4,GPIO_AF0
#define EVENTOUT_PE0_ PE0,GPIO_AF1
#define EVENTOUT_PE1_ PE1,GPIO_AF1
#define EVENTOUT_PF2_ PF2,GPIO_AF0
#define EVENTOUT_PF3_ PF3,GPIO_AF0
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PF2_ 1
#define _EVENTOUT_PF3_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF1
#define I2C1_SCL_PB8_ PB8,GPIO_AF1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF1
#define I2C1_SDA_PB9_ PB9,GPIO_AF1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF3
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF1
#define I2C2_SCL_PB13_ PB13,GPIO_AF5
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF1
#define I2C2_SDA_PB14_ PB14,GPIO_AF5
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF0
#define I2S1_CK_PB3_ PB3,GPIO_AF0
#define I2S1_CK_PE13_ PE13,GPIO_AF1
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PE13_ 1

#define I2S1_MCK_PA6_ PA6,GPIO_AF0
#define I2S1_MCK_PB4_ PB4,GPIO_AF0
#define I2S1_MCK_PE14_ PE14,GPIO_AF1
#define _I2S1_MCK_PA6_ 1
#define _I2S1_MCK_PB4_ 1
#define _I2S1_MCK_PE14_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF0
#define I2S1_SD_PB5_ PB5,GPIO_AF0
#define I2S1_SD_PE15_ PE15,GPIO_AF1
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1
#define _I2S1_SD_PE15_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF0
#define I2S1_WS_PA4_ PA4,GPIO_AF0
#define I2S1_WS_PE12_ PE12,GPIO_AF1
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PE12_ 1

#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF0
#define I2S2_CK_PD1_ PD1,GPIO_AF1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD1_ 1

#define I2S2_MCK_PB14_ PB14,GPIO_AF0
#define I2S2_MCK_PC2_ PC2,GPIO_AF1
#define I2S2_MCK_PD3_ PD3,GPIO_AF1
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PC2_ 1
#define _I2S2_MCK_PD3_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF0
#define I2S2_SD_PC3_ PC3,GPIO_AF1
#define I2S2_SD_PD4_ PD4,GPIO_AF1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF0
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PD0_ PD0,GPIO_AF1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PD0_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF0
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define SPI1_MISO_PE14_ PE14,GPIO_AF1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PE14_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define SPI1_MOSI_PE15_ PE15,GPIO_AF1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PE12_ PE12,GPIO_AF1
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PE12_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define SPI1_SCK_PE13_ PE13,GPIO_AF1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PE13_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PC2_ PC2,GPIO_AF1
#define SPI2_MISO_PD3_ PD3,GPIO_AF1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PC3_ PC3,GPIO_AF1
#define SPI2_MOSI_PD4_ PD4,GPIO_AF1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define SPI2_SCK_PD1_ PD1,GPIO_AF1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1

#define SYS_- functionality on new pin (forecasted in Stingray 64K pinout file)_PD8_ PD8,GPIO_AF4
#define _SYS_- functionality on new pin (forecasted in Stingray 64K pinout file)_PD8_ 1

#define SYS_- new functionality (not forecasted in Stingray 64K pinout file)_PD4_ PD4,GPIO_AF4
#define _SYS_- new functionality (not forecasted in Stingray 64K pinout file)_PD4_ 1

#define SYS_- new pin (not existing on Stingray 64K)_PD3_ PD3,GPIO_AF4
#define _SYS_- new pin (not existing on Stingray 64K)_PD3_ 1

#define SYS_CAN_PC15_ PC15,GPIO_AF7
#define _SYS_CAN_PC15_ 1

#define SYS_COMP_PC14_ PC14,GPIO_AF7
#define _SYS_COMP_PC14_ 1

#define SYS_DAC_PC14_ PC14,GPIO_AF7
#define _SYS_DAC_PC14_ 1

#define SYS_I2C_PC0_ PC0,GPIO_AF7
#define _SYS_I2C_PC0_ 1

#define SYS_IR-Out_PC13_ PC13,GPIO_AF7
#define _SYS_IR-Out_PC13_ 1

#define SYS_SPI_PC1_ PC1,GPIO_AF7
#define _SYS_SPI_PC1_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define SYS_SYSTEM_PC3_ PC3,GPIO_AF7
#define _SYS_SYSTEM_PC3_ 1

#define SYS_TIM1_PC6_ PC6,GPIO_AF7
#define _SYS_TIM1_PC6_ 1

#define SYS_TIM14_PC9_ PC9,GPIO_AF7
#define _SYS_TIM14_PC9_ 1

#define SYS_TIM15_PC10_ PC10,GPIO_AF7
#define _SYS_TIM15_PC10_ 1

#define SYS_TIM16_PC11_ PC11,GPIO_AF7
#define _SYS_TIM16_PC11_ 1

#define SYS_TIM17_PC12_ PC12,GPIO_AF7
#define _SYS_TIM17_PC12_ 1

#define SYS_TIM2_PC7_ PC7,GPIO_AF7
#define _SYS_TIM2_PC7_ 1

#define SYS_TIM3_PC8_ PC8,GPIO_AF7
#define _SYS_TIM3_PC8_ 1

#define SYS_TOUCH_PC5_ PC5,GPIO_AF7
#define _SYS_TOUCH_PC5_ 1

#define SYS_USART_PC2_ PC2,GPIO_AF7
#define _SYS_USART_PC2_ 1

#define TIM14_CH1_PA4_ PA4,GPIO_AF4
#define TIM14_CH1_PA7_ PA7,GPIO_AF4
#define TIM14_CH1_PB1_ PB1,GPIO_AF0
#define _TIM14_CH1_PA4_ 1
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PB1_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF0
#define TIM15_BKIN_PB12_ PB12,GPIO_AF5
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PB12_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF0
#define TIM15_CH1_PB14_ PB14,GPIO_AF1
#define TIM15_CH1_PF9_ PF9,GPIO_AF0
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PF9_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF5
#define TIM15_CH1N_PB15_ PB15,GPIO_AF3
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB15_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF0
#define TIM15_CH2_PB15_ PB15,GPIO_AF1
#define TIM15_CH2_PF10_ PF10,GPIO_AF0
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PF10_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF2
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF5
#define TIM16_CH1_PB8_ PB8,GPIO_AF2
#define TIM16_CH1_PE0_ PE0,GPIO_AF0
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF2
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF0
#define TIM17_BKIN_PB4_ PB4,GPIO_AF5
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF5
#define TIM17_CH1_PB9_ PB9,GPIO_AF2
#define TIM17_CH1_PE1_ PE1,GPIO_AF0
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF2
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF2
#define TIM1_BKIN_PB12_ PB12,GPIO_AF2
#define TIM1_BKIN_PE15_ PE15,GPIO_AF0
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF2
#define TIM1_CH1_PE9_ PE9,GPIO_AF0
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF2
#define TIM1_CH1N_PB13_ PB13,GPIO_AF2
#define TIM1_CH1N_PE8_ PE8,GPIO_AF0
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF2
#define TIM1_CH2_PE11_ PE11,GPIO_AF0
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF2
#define TIM1_CH2N_PB14_ PB14,GPIO_AF2
#define TIM1_CH2N_PE10_ PE10,GPIO_AF0
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF2
#define TIM1_CH3_PE13_ PE13,GPIO_AF0
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF2
#define TIM1_CH3N_PB15_ PB15,GPIO_AF2
#define TIM1_CH3N_PE12_ PE12,GPIO_AF0
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF2
#define TIM1_CH4_PE14_ PE14,GPIO_AF0
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF2
#define TIM1_ETR_PE7_ PE7,GPIO_AF0
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF2
#define TIM2_CH1_PA5_ PA5,GPIO_AF2
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF2
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF1
#define TIM3_CH1_PB4_ PB4,GPIO_AF1
#define TIM3_CH1_PC6_ PC6,GPIO_AF0
#define TIM3_CH1_PE3_ PE3,GPIO_AF0
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF1
#define TIM3_CH2_PB5_ PB5,GPIO_AF1
#define TIM3_CH2_PC7_ PC7,GPIO_AF0
#define TIM3_CH2_PE4_ PE4,GPIO_AF0
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF1
#define TIM3_CH3_PC8_ PC8,GPIO_AF0
#define TIM3_CH3_PE5_ PE5,GPIO_AF0
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE5_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF1
#define TIM3_CH4_PC9_ PC9,GPIO_AF0
#define TIM3_CH4_PE6_ PE6,GPIO_AF0
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE6_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF0
#define TIM3_ETR_PE2_ PE2,GPIO_AF0
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC5_ PC5,GPIO_AF0
#define _TSC_G3_IO1_PC5_ 1

#define TSC_G3_IO2_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO2_PB0_ 1

#define TSC_G3_IO3_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO3_PB1_ 1

#define TSC_G3_IO4_PB2_ PB2,GPIO_AF3
#define _TSC_G3_IO4_PB2_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA11_ PA11,GPIO_AF3
#define _TSC_G4_IO3_PA11_ 1

#define TSC_G4_IO4_PA12_ PA12,GPIO_AF3
#define _TSC_G4_IO4_PA12_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

#define TSC_G5_IO4_PB7_ PB7,GPIO_AF3
#define _TSC_G5_IO4_PB7_ 1

#define TSC_G6_IO1_PB11_ PB11,GPIO_AF3
#define _TSC_G6_IO1_PB11_ 1

#define TSC_G6_IO2_PB12_ PB12,GPIO_AF3
#define _TSC_G6_IO2_PB12_ 1

#define TSC_G6_IO3_PB13_ PB13,GPIO_AF3
#define _TSC_G6_IO3_PB13_ 1

#define TSC_G6_IO4_PB14_ PB14,GPIO_AF3
#define _TSC_G6_IO4_PB14_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF1
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE3_ PE3,GPIO_AF1
#define _TSC_G7_IO2_PE3_ 1

#define TSC_G7_IO3_PE4_ PE4,GPIO_AF1
#define _TSC_G7_IO3_PE4_ 1

#define TSC_G7_IO4_PE5_ PE5,GPIO_AF1
#define _TSC_G7_IO4_PE5_ 1

#define TSC_G8_IO1_PD12_ PD12,GPIO_AF1
#define _TSC_G8_IO1_PD12_ 1

#define TSC_G8_IO2_PD13_ PD13,GPIO_AF1
#define _TSC_G8_IO2_PD13_ 1

#define TSC_G8_IO3_PD14_ PD14,GPIO_AF1
#define _TSC_G8_IO3_PD14_ 1

#define TSC_G8_IO4_PD15_ PD15,GPIO_AF1
#define _TSC_G8_IO4_PD15_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF3
#define TSC_SYNC_PB8_ PB8,GPIO_AF3
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PB8_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF1
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF1
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF1
#define _UART1_DE_PA12_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF1
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF1
#define UART1_RX_PB7_ PB7,GPIO_AF0
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF1
#define UART1_TX_PB6_ PB6,GPIO_AF0
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF1
#define UART2_CK_PD7_ PD7,GPIO_AF0
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF1
#define UART2_CTS_PD3_ PD3,GPIO_AF0
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF1
#define UART2_DE_PD4_ PD4,GPIO_AF0
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF1
#define UART2_RTS_PD4_ PD4,GPIO_AF0
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF1
#define UART2_RX_PA3_ PA3,GPIO_AF1
#define UART2_RX_PD6_ PD6,GPIO_AF0
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF1
#define UART2_TX_PA2_ PA2,GPIO_AF1
#define UART2_TX_PD5_ PD5,GPIO_AF0
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB0_ PB0,GPIO_AF4
#define UART3_CK_PB12_ PB12,GPIO_AF4
#define UART3_CK_PC12_ PC12,GPIO_AF1
#define UART3_CK_PD10_ PD10,GPIO_AF0
#define _UART3_CK_PB0_ 1
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF4
#define UART3_CTS_PB13_ PB13,GPIO_AF4
#define UART3_CTS_PD11_ PD11,GPIO_AF0
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PB1_ PB1,GPIO_AF4
#define UART3_DE_PB14_ PB14,GPIO_AF4
#define UART3_DE_PD12_ PD12,GPIO_AF0
#define UART3_DE_PD2_ PD2,GPIO_AF1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PD2_ 1

#define UART3_RTS_PB1_ PB1,GPIO_AF4
#define UART3_RTS_PB14_ PB14,GPIO_AF4
#define UART3_RTS_PD12_ PD12,GPIO_AF0
#define UART3_RTS_PD2_ PD2,GPIO_AF1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF4
#define UART3_RX_PC11_ PC11,GPIO_AF1
#define UART3_RX_PC5_ PC5,GPIO_AF1
#define UART3_RX_PD9_ PD9,GPIO_AF0
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF4
#define UART3_TX_PC10_ PC10,GPIO_AF1
#define UART3_TX_PC4_ PC4,GPIO_AF1
#define UART3_TX_PD8_ PD8,GPIO_AF0
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CK_PC12_ PC12,GPIO_AF0
#define _UART4_CK_PC12_ 1

#define UART4_CTS_PB7_ PB7,GPIO_AF4
#define _UART4_CTS_PB7_ 1

#define UART4_DE_PA15_ PA15,GPIO_AF4
#define _UART4_DE_PA15_ 1

#define UART4_RTS_PA15_ PA15,GPIO_AF4
#define _UART4_RTS_PA15_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF4
#define UART4_RX_PC11_ PC11,GPIO_AF0
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PC11_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF4
#define UART4_TX_PC10_ PC10,GPIO_AF0
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PC10_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF1
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF1
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF1
#define _USART1_DE_PA12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF1
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF1
#define USART1_RX_PB7_ PB7,GPIO_AF0
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF1
#define USART1_TX_PB6_ PB6,GPIO_AF0
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF1
#define USART2_CK_PD7_ PD7,GPIO_AF0
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF1
#define USART2_CTS_PD3_ PD3,GPIO_AF0
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF1
#define USART2_DE_PD4_ PD4,GPIO_AF0
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF1
#define USART2_RTS_PD4_ PD4,GPIO_AF0
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF1
#define USART2_RX_PA3_ PA3,GPIO_AF1
#define USART2_RX_PD6_ PD6,GPIO_AF0
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF1
#define USART2_TX_PA2_ PA2,GPIO_AF1
#define USART2_TX_PD5_ PD5,GPIO_AF0
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB0_ PB0,GPIO_AF4
#define USART3_CK_PB12_ PB12,GPIO_AF4
#define USART3_CK_PC12_ PC12,GPIO_AF1
#define USART3_CK_PD10_ PD10,GPIO_AF0
#define _USART3_CK_PB0_ 1
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PA6_ PA6,GPIO_AF4
#define USART3_CTS_PB13_ PB13,GPIO_AF4
#define USART3_CTS_PD11_ PD11,GPIO_AF0
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_DE_PB1_ PB1,GPIO_AF4
#define USART3_DE_PB14_ PB14,GPIO_AF4
#define USART3_DE_PD12_ PD12,GPIO_AF0
#define USART3_DE_PD2_ PD2,GPIO_AF1
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PD2_ 1

#define USART3_RTS_PB1_ PB1,GPIO_AF4
#define USART3_RTS_PB14_ PB14,GPIO_AF4
#define USART3_RTS_PD12_ PD12,GPIO_AF0
#define USART3_RTS_PD2_ PD2,GPIO_AF1
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF4
#define USART3_RX_PC11_ PC11,GPIO_AF1
#define USART3_RX_PC5_ PC5,GPIO_AF1
#define USART3_RX_PD9_ PD9,GPIO_AF0
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF4
#define USART3_TX_PC10_ PC10,GPIO_AF1
#define USART3_TX_PC4_ PC4,GPIO_AF1
#define USART3_TX_PD8_ PD8,GPIO_AF0
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1
#define _USART3_TX_PD8_ 1

#define USART4_CK_PC12_ PC12,GPIO_AF0
#define _USART4_CK_PC12_ 1

#define USART4_CTS_PB7_ PB7,GPIO_AF4
#define _USART4_CTS_PB7_ 1

#define USART4_DE_PA15_ PA15,GPIO_AF4
#define _USART4_DE_PA15_ 1

#define USART4_RTS_PA15_ PA15,GPIO_AF4
#define _USART4_RTS_PA15_ 1

#define USART4_RX_PA1_ PA1,GPIO_AF4
#define USART4_RX_PC11_ PC11,GPIO_AF0
#define _USART4_RX_PA1_ 1
#define _USART4_RX_PC11_ 1

#define USART4_TX_PA0_ PA0,GPIO_AF4
#define USART4_TX_PC10_ PC10,GPIO_AF0
#define _USART4_TX_PA0_ 1
#define _USART4_TX_PC10_ 1

#define USB_NOE_PA13_ PA13,GPIO_AF2
#define _USB_NOE_PA13_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */